<a href="https://colab.research.google.com/github/mohd-faizy/_Pandas_CodeDump/blob/master/04_Paandas_Code_dump.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# __Pandas Dump__

In [ ]:
# import modules
import pandas as pd

__Create some dummy data__

In [ ]:
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
'age': [20, 19, 22, 21],
'favorite_color': ['blue', 'blue', 'yellow', "green"],
'grade': [88, 92, 95, 70]}

df = pd.DataFrame(raw_data)
df.head()

               name  age favorite_color  grade
0    Willard Morris   20           blue     88
1       Al Jennings   19           blue     92
2      Omar Mullins   22         yellow     95
3  Spencer McDaniel   21          green     70

__Select rows based on column value:__

In [ ]:
# To select rows whose column value equals a scalar, some_value, use ==:
df.loc[df['favorite_color'] == 'yellow']

           name  age favorite_color  grade
2  Omar Mullins   22         yellow     95

__Select rows whose column value is in an iterable array:__

In [ ]:
# To select rows whose column value is in an iterable array, which we'll define as array, you can use isin:
array = ['yellow', 'green']
df.loc[df['favorite_color'].isin(array)]

               name  age favorite_color  grade
2      Omar Mullins   22         yellow     95
3  Spencer McDaniel   21          green     70

__Select rows based on multiple column conditions:__

In [ ]:
# To select a row based on multiple conditions you can use &:
array = ['yellow', 'green']
df.loc[(df['age'] == 21) & df['favorite_color'].isin(array)]

               name  age favorite_color  grade
3  Spencer McDaniel   21          green     70

__Select rows where column does not equal a value:__

In [ ]:
# To select rows where a column value does not equal a value, use !=:
df.loc[df['favorite_color'] != 'yellow']

               name  age favorite_color  grade
0    Willard Morris   20           blue     88
1       Al Jennings   19           blue     92
3  Spencer McDaniel   21          green     70

__Select rows whose column value is not in an iterable array:__

In [ ]:
# Tilda
# To return a rows where column value is not in an iterable array, use ~ in front of df:
array = ['yellow', 'green']
df.loc[~df['favorite_color'].isin(array)]

             name  age favorite_color  grade
0  Willard Morris   20           blue     88
1     Al Jennings   19           blue     92

# __Slicing__

## $${Rows,Columns}$$

## $${Start:Stop[excluding]}$$

In [ ]:
df = pd.DataFrame({'A':[1,2,3,4,5,6],
                   'B':[4,5,6,1,2,3],
                   'C':[7,8,9,1,2,3],
                   'D':[1,3,5,1,2,3],
                   'E':[5,3,6,1,2,3],
                   'F':[7,4,3,1,2,3]})
df.head()

   A  B  C  D  E  F
0  1  4  7  1  5  7
1  2  5  8  3  3  4
2  3  6  9  5  6  3
3  4  1  1  1  1  1
4  5  2  2  2  2  2

In [ ]:
df.iloc[:, :]

   A  B  C  D  E  F
0  1  4  7  1  5  7
1  2  5  8  3  3  4
2  3  6  9  5  6  3
3  4  1  1  1  1  1
4  5  2  2  2  2  2
5  6  3  3  3  3  3

In [ ]:
df.iloc[1:, :]

   A  B  C  D  E  F
1  2  5  8  3  3  4
2  3  6  9  5  6  3
3  4  1  1  1  1  1
4  5  2  2  2  2  2
5  6  3  3  3  3  3

In [ ]:
df.iloc[:1, :]

   A  B  C  D  E  F
0  1  4  7  1  5  7

In [ ]:
df.iloc[-1:, :]

   A  B  C  D  E  F
5  6  3  3  3  3  3

In [ ]:
df.iloc[:, 1:]

   B  C  D  E  F
0  4  7  1  5  7
1  5  8  3  3  4
2  6  9  5  6  3
3  1  1  1  1  1
4  2  2  2  2  2
5  3  3  3  3  3

In [ ]:
df.iloc[:, :1]

   A
0  1
1  2
2  3
3  4
4  5
5  6

In [ ]:
df.iloc[:, :-1]

   A  B  C  D  E
0  1  4  7  1  5
1  2  5  8  3  3
2  3  6  9  5  6
3  4  1  1  1  1
4  5  2  2  2  2
5  6  3  3  3  3

In [ ]:
df.iloc[1:, :-1]

   A  B  C  D  E
1  2  5  8  3  3
2  3  6  9  5  6
3  4  1  1  1  1
4  5  2  2  2  2
5  6  3  3  3  3

In [ ]:
df.iloc[1:, :1]

   A
1  2
2  3
3  4
4  5
5  6

In [ ]:
df.iloc[1:3, 2:4]

   C  D
1  8  3
2  9  5